export function getAll() {
    const fishes = JSON.parse(JSON.stringify(FISHES));
    fishes.sort(sortByName);
    return fishes;
}

export function getAllOfNow() {
    const now = new Date();
    const month = now.getMonth();
    const timeIndex = (() => {
        const h = now.getHours();
        if (h >= 4 && h < 9) {
            return 0;
        } else if (h >= 9 && h < 16) {
            return 1;
        } else if (h >= 16 && h < 21) {
            return 2;
        } else {
            return 3;
        }
    })();
    const fishes = FISHES.filter(fish =>
        fish.months[month] & fish.times[timeIndex]
    );
    fishes.sort(sortByName);
    return JSON.parse(JSON.stringify(fishes));
}

function sortByName(a, b) {
    if (a.name < b.name) {
        return -1;
    }
    if (b.name < a.name) {
        return 1;
    }
    return 0;
}

const FISHES = [
    {
        "name": "タナゴ",
        "sell": 900,
        "months": [1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "オイカワ",
        "sell": 200,
        "months": [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        "times": [0, 1, 0, 0]
    },
    {
        "name": "フナ",
        "sell": 160,
        "months": [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "ウグイ",
        "sell": 240,
        "months": [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        "times": [1, 0, 1, 1]
    },
    {
        "name": "コイ",
        "sell": 300,
        "months": [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "ニシキゴイ",
        "sell": 4000,
        "months": [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        "times": [1, 0, 1, 1]
    },
    {
        "name": "キンギョ",
        "sell": 1300,
        "months": [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "デメキン",
        "sell": 1300,
        "months": [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        "times": [0, 1, 0, 0]
    },
    {
        "name": "ランチュウ",
        "sell": 4500,
        "months": [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        "times": [0, 1, 0, 0]
    },
    {
        "name": "メダカ",
        "sell": 300,
        "months": [0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "ザリガニ",
        "sell": 200,
        "months": [0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 0],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "スッポン",
        "sell": 3750,
        "months": [0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0],
        "times": [1, 0, 1, 1]
    },
    {
        "name": "カミツキガメ",
        "sell": 5000,
        "months": [0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0],
        "times": [0, 0, 0, 1]
    },
    {
        "name": "オタマジャクシ",
        "sell": 100,
        "months": [0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "カエル",
        "sell": 120,
        "months": [0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "ドンコ",
        "sell": 400,
        "months": [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        "times": [1, 0, 1, 1]
    },
    {
        "name": "ドジョウ",
        "sell": 400,
        "months": [0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "ナマズ",
        "sell": 800,
        "months": [0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0],
        "times": [1, 0, 1, 1]
    },
    {
        "name": "ライギョ",
        "sell": 5500,
        "months": [0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0],
        "times": [0, 1, 0, 0]
    },
    {
        "name": "ブルーギル",
        "sell": 180,
        "months": [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        "times": [0, 1, 0, 0]
    },
    {
        "name": "イエローパーチ",
        "sell": 300,
        "months": [1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "ブラックバス",
        "sell": 400,
        "months": [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "ティラピア",
        "sell": 800,
        "months": [0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "パイク",
        "sell": 1800,
        "months": [0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "ワカサギ",
        "sell": 400,
        "months": [1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "アユ",
        "sell": 900,
        "months": [0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "ヤマメ",
        "sell": 1000,
        "months": [0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 0],
        "times": [1, 0, 1, 1]
    },
    {
        "name": "オオイワナ",
        "sell": 3800,
        "months": [0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 0],
        "times": [1, 0, 1, 1]
    },
    {
        "name": "ゴールデントラウト",
        "sell": 15000,
        "months": [0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0],
        "times": [1, 0, 1, 1]
    },
    {
        "name": "イトウ",
        "sell": 15000,
        "months": [1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1],
        "times": [1, 0, 1, 1]
    },
    {
        "name": "サケ",
        "sell": 700,
        "months": [0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "キングサーモン",
        "sell": 1800,
        "months": [0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "シャンハイガニ",
        "sell": 2000,
        "months": [0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0],
        "times": [1, 0, 1, 1]
    },
    {
        "name": "グッピー",
        "sell": 1300,
        "months": [0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0],
        "times": [0, 1, 0, 0]
    },
    {
        "name": "ドクターフィッシュ",
        "sell": 1500,
        "months": [0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0],
        "times": [0, 1, 0, 0]
    },
    {
        "name": "エンゼルフィッシュ",
        "sell": 3000,
        "months": [0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0],
        "times": [1, 0, 1, 1]
    },
    {
        "name": "ベタ",
        "sell": 2500,
        "months": [0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0],
        "times": [0, 1, 0, 0]
    },
    {
        "name": "ネオンテトラ",
        "sell": 500,
        "months": [0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0],
        "times": [0, 1, 0, 0]
    },
    {
        "name": "レインボーフィッシュ",
        "sell": 800,
        "months": [0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0],
        "times": [0, 1, 0, 0]
    },
    {
        "name": "ピラニア",
        "sell": 2500,
        "months": [0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0],
        "times": [0, 1, 0, 1]
    },
    {
        "name": "アロワナ",
        "sell": 10000,
        "months": [0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0],
        "times": [1, 0, 1, 1]
    },
    {
        "name": "ドラド",
        "sell": 15000,
        "months": [0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0],
        "times": [1, 1, 1, 0]
    },
    {
        "name": "ガー",
        "sell": 6000,
        "months": [0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0],
        "times": [1, 0, 1, 1]
    },
    {
        "name": "ピラルク",
        "sell": 10000,
        "months": [0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0],
        "times": [1, 0, 1, 1]
    },
    {
        "name": "エンドリケリー",
        "sell": 4000,
        "months": [0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0],
        "times": [0, 0, 0, 1]
    },
    {
        "name": "チョウザメ",
        "sell": 10000,
        "months": [1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "クリオネ",
        "sell": 1000,
        "months": [1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "タツノオトシゴ",
        "sell": 1100,
        "months": [0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "クマノミ",
        "sell": 650,
        "months": [0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 0],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "ナンヨウハギ",
        "sell": 1000,
        "months": [0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 0],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "チョウチョウウオ",
        "sell": 1000,
        "months": [0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 0],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "ナポレオンフィッシュ",
        "sell": 10000,
        "months": [0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0],
        "times": [1, 1, 1, 0]
    },
    {
        "name": "ミノカサゴ",
        "sell": 500,
        "months": [0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "フグ",
        "sell": 5000,
        "months": [1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1],
        "times": [0, 0, 0, 1]
    },
    {
        "name": "ハリセンボン",
        "sell": 250,
        "months": [0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "アンチョビ",
        "sell": 200,
        "months": [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        "times": [1, 1, 1, 0]
    },
    {
        "name": "アジ",
        "sell": 150,
        "months": [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "イシダイ",
        "sell": 5000,
        "months": [0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "スズキ",
        "sell": 400,
        "months": [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "タイ",
        "sell": 3000,
        "months": [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "カレイ",
        "sell": 300,
        "months": [1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "ヒラメ",
        "sell": 800,
        "months": [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "イカ",
        "sell": 500,
        "months": [1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "ウツボ",
        "sell": 2000,
        "months": [0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "ハナヒゲウツボ",
        "sell": 600,
        "months": [0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "マグロ",
        "sell": 7000,
        "months": [1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "カジキ",
        "sell": 10000,
        "months": [1, 1, 1, 1, 10, 0, 1, 1, 1, 0, 1, 1],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "ロウニンアジ",
        "sell": 4500,
        "months": [0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "シイラ",
        "sell": 6000,
        "months": [0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "マンボウ",
        "sell": 4000,
        "months": [0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0],
        "times": [1, 1, 1, 0]
    },
    {
        "name": "エイ",
        "sell": 3000,
        "months": [0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0],
        "times": [1, 1, 1, 0]
    },
    {
        "name": "ノコギリザメ",
        "sell": 12000,
        "months": [0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0],
        "times": [1, 0, 1, 1]
    },
    {
        "name": "シュモクザメ",
        "sell": 8000,
        "months": [0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0],
        "times": [1, 0, 1, 1]
    },
    {
        "name": "サメ",
        "sell": 15000,
        "months": [0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0],
        "times": [1, 0, 1, 1]
    },
    {
        "name": "ジンベエザメ",
        "sell": 13000,
        "months": [0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "コバンザメ",
        "sell": 1500,
        "months": [0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "チョウチンアンコウ",
        "sell": 2500,
        "months": [1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1],
        "times": [1, 0, 1, 1]
    },
    {
        "name": "リュウグウノツカイ",
        "sell": 9000,
        "months": [1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1],
        "times": [1, 1, 1, 1]
    },
    {
        "name": "デメニギス",
        "sell": 15000,
        "months": [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        "times": [0, 0, 0, 1]
    },
    {
        "name": "シーラカンス",
        "sell": 15000,
        "months": [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        "times": [1, 1, 1, 1]
    },
];